import '../zikr/zikr.scss'
import { Link } from "react-router-dom"
import ZikrHeader from '../../assets/components/zikr-header/zikr-header'
import Bottom from '../../assets/components/bottom/bottom'

const Duolar =()=>{
    return(
        <div className="duolar">
            <ZikrHeader title={"Namozdagi Duolar"} className="duolar-header" />
            <div className="duolar-container container">
            <ul className="duolar-list">
            <li className="duolar-item">
            <h3 className="zikr-item-title" >Самиъаллоҳу лиман ҳамидаҳ</h3>
            <p className="zikr-item-arab-text">سَمِعَ اللهُ لِمَنْ حَمِدَهُ رَبَّنَا لَكَ الْحَمْدُ</p>
            <p className="zikr-item-text">Субҳана роббийал аъла</p>
                <p className="zikr-item-text-translate italic-text"> <strong> Manosi :</strong>Олий Роббим нуқсонлардан покдир.</p>
                <p className="zikr-item-text-translate"><strong>Hadis: </strong>Расулуллоҳ алайҳиссалом: <br />
                 <br /> <strong>«Агар бирортангиз сажда қилса, камида уч марта:«Субҳана роббийал аъла, Субҳана роббийал аъла, Субҳана роббийал аъла», деб айтсин»</strong> , дедилар.
                </p>
                <p className="zikr-item-text-translate  italic-text">Сунан китобларида ривоят қилинган.</p>
            </li>
            <li className="duolar-item">
            <h3 className="zikr-item-title" >Қунут дуоси</h3>
            <p className="zikr-item-arab-text">اللهُمَّ إِنَّا نَسْتَعِينُكَ وَنَسْتَغْفِرُكَ وَنُؤْمِنُ بِكَ وَنَتَوَكَّلُ عَلَيْكَ وَنُسْنِي عَلَيْكَ الْخَيْرَ كُلَّهُ نَشْكُرُكَ وَلاَ نَكْفُرُكَ وَنَخْلَعُ وَنَتْرُكُ مَنْ يَفْجُرُكَ، اللهُمَّ إِيَّاكَ نَعْبُدُ وَلَكَ نُصَلِّي وَنَسْجُدُ وَإِلَيْكَ نَسْعَي وَنَحْفِدُ نَرْجُو رَحْمَتَكَ وَنَخْشَى عَذَابَكَ إِنَّ عَذَابَكَ بِالكُفَّارِ مُلْحِقٌ
              </p>
               <p className="zikr-item-text">Аллоҳумма инна настаъийнука ва настағфирука ва ну`мину бика ва натаваккалу ъалайка ва нусний ъалайкал хойро куллаҳ, нашкурука ва ла накфурука ва нахлаъу ва натруку май йафжурук. Аллоҳумма иййака наъбуду ва лака нусоллий ва насжуду ва илайка насъа ва наҳфиду наржу роҳматака ва нахша ъазабака инна ъазабака билкуффари мулҳиқ.</p>
                <p className="zikr-item-text-translate italic-text"> <strong> Manosi :</strong>Эй Раббим, Сенинг ёрдам беришингни, ҳидоят қилишингни, гуноҳларни кечишингни сўрайман. Сенга тавба қилдим, иймон келтирдим ва Сенга суяндим. Яхшиликларнинг барчаси билан Сени сифатлаймиз. Сенга шукр қиламиз, ношукрлик қилмаймиз. Сенга фожирлик қилганлардан четлашамиз. Эй Раббим, Сенга ибодат, намоз, сажда этамиз. Ва Сенинг йўлингда саъй-ҳаракат қилиб, раҳматингни умид қиламиз. Азобингдан қўрқамиз. Албатта, ҳақ азобинг кофирларга рўпара қилинувчидир.
                </p>
            </li>
            <li className="duolar-item">
            <h3 className="zikr-item-title" >Ташаҳҳуд дуоси</h3>
            <p className="zikr-item-arab-text">اَلتَّحِيَّاتُ للهِ وَالصَّلَوَاتُ وَالطَيِّبَاتُ السَّلاَمُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللهِ وَبَرَكَاتُهُ السَّلاَمُ عَلَيْنَا وَعَلَى عِبَادِ اللهِ الصَّالِحِينَ، أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ</p>
            <p className="zikr-item-text">Аттаҳиййату лиллаҳи вассолавату ваттоййибат ассаламу ъалайка аййуҳан набиййу ва роҳматуллоҳи ва барокатуҳ. Ассаламу ъалайна ва ъала ъибадиллаҳис солиҳийн. Ашҳаду алла илаҳа иллаллоҳу ва ашҳаду анна Муҳаммадан ъабдуҳу ва росулуҳ</p>
                <p className="zikr-item-text-translate  italic-text"> <strong> Manosi :</strong>Саломлар, дуолар ва яхшиликларнинг барчаси Аллоҳ учундир. Эй Пайғамбар, сизга салом ва Аллоҳнинг раҳматию баракоти бўлсин. Бизларга ва Аллоҳнинг солиҳ бандаларига ҳам салом бўлсин. Аллоҳдан бошқа илоҳ йўқ деб гувоҳлик бераман. Ва яна Муҳаммад Аллоҳнинг бандаси ва расули деб гувоҳлик бераман.</p>
                <p className="zikr-item-text-translate"><strong>Hadis: </strong> Ибн Масъуд розияллоҳу анҳудан ривоят қилинади:<br />
                 <br />Расулуллоҳ соллаллоҳу алайҳи васаллам ташаҳҳудда : <strong>«Аттаҳиййату лиллаҳи вассолавату ваттоййибат ассаламу ъалайка аййуҳан набиййу ва роҳматуллоҳи ва барокатуҳ. Ассаламу ъалайна ва ъала ъибадиллаҳис солиҳийн. Ашҳаду алла илаҳа иллаллоҳу ва ашҳаду анна Муҳаммадан ъабдуҳу ва росулуҳ»</strong> , деб айтдилар.
                </p>
                <p className="zikr-item-text-translate  italic-text">Имом Бухорий ва Муслим ривоятлари.</p>
            </li>
            <li className="duolar-item">
            <h3 className="zikr-item-title" >Намоздан кейинги дуо</h3>
            <p className="zikr-item-arab-text">اللهُمَّ أَنْتَ السَّلاَمُ وَمِنْكَ السَّلاَمُ تَبَارَكْتَ يَا ذَا الْجَلاَلِ وَالإِكْرَامِ</p>
            <p className="zikr-item-text">Аллоҳумма антас салам ва минкас салам, табарокта йа зал жалали вал икром</p>
                <p className="zikr-item-text-translate  italic-text"> <strong> Manosi :</strong>Эй Аллоҳим, Сен саломсан ва салом Сендандир. Эй улуғ ва ҳурматли зот, Сен баракотлисан.</p>
                <p className="zikr-item-text-translate"><strong>Hadis: </strong>Савбон розияллоҳу анҳудан ривоят қилинади:<br />
                 <br />Расулуллоҳ соллаллоҳу алайҳи васаллам намозни тугатсалар, уч марта «Астағфируллоҳ», деб сўнгра:
                <strong>«Аллоҳумма антас салам ва минкас салам, табарокта йа зал жалали вал икром»</strong>, деб айтар эдилар.
                </p>
                <p className="zikr-item-text-translate  italic-text">Имом Муслим ривоятлари.</p>
            </li>
            <li className="duolar-item">
            <h3 className="zikr-item-title" >Намоздан кейинги зикр</h3>
            <p className="zikr-item-arab-text">لاَ إِلَهَ إِلاَّ اللهُ وَحْدَهُ لاَ شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، اللهُمَّ لاَ مَانِعَ لِمَا أَعْطَيْتَ وَلاَ مُعْطِيَ لِمَا مَنَعْتَ وَلاَ يَنْفَعُ ذَا الْجَدِّ مِنْكَ الْجَدُّ</p>
            <p className="zikr-item-text">Ла илаҳа иллаллоҳу ваҳдаҳу ла шарийка лаҳу, лаҳул мулку ва лаҳул ҳамду ва ҳува ъала кулли шай`ин қодир. Аллоҳумма ла маниъа лима аътойта ва ла муътийа лима манаъта ва ла йанфаъу зал жадди минкал жадд</p>
                <p className="zikr-item-text-translate  italic-text"> <strong> Manosi :</strong>Аллоҳдан ўзга илоҳ йўқ, Унинг шериги ҳам йўқ. Мутлақ мулк Уники ва ҳамд ҳам Унгадир. У ҳар нарсага қодирдир. Эй Раббим, Сен берган нарсани манъ қилувчи йўқ. Ва Сен манъ қилган нарсани берувчи йўқ. Буюклик Сендандир, бошқанинг буюклиги фойда бермайди.</p>
                <p className="zikr-item-text-translate"><strong>Hadis: </strong>Муғийра ибн Шўъба розияллоҳу анҳудан ривоят қилинади:<br />
                 <br />Расулуллоҳ соллаллоҳу алайҳи васаллам намоздан фориғ бўлсалар:
                <strong>«Ла илаҳа иллаллоҳу ваҳдаҳу ла шарийка лаҳу, лаҳул мулку ва лаҳул ҳамду ва ҳува ъала кулли шай`ин қодир. Аллоҳумма ла маниъа лима аътойта ва ла муътийа лима манаъта ва ла йанфаъу зал жадди минкал жадд»</strong>ни ўқир эдилар.
                </p>
                <p className="zikr-item-text-translate italic-text">Имом Бухорий ва Муслим ривоятлари.</p>
            </li>
            <li className="duolar-item">
            <h3 className="zikr-item-title" >Намоздан кейинги зикр</h3>
            <p className="zikr-item-arab-text">لاَ إِلَهَ إِلاَّ اللهُ وَحْدَهُ لاَ شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ</p>
            <p className="zikr-item-text">Ла илаҳа иллаллоҳу ваҳдаҳу ла шарийка лаҳ, лаҳул мулку ва лаҳул ҳамду ва ҳува ъала кулли шай`ин қодийр</p>
                <p className="zikr-item-text-translate  italic-text"> <strong> Manosi :</strong>Аллоҳдан бошқа илоҳ йўқ, У ёлғиз, Унинг шериги ҳам йўқ, бутун мулк Уники, ҳамд ҳам Унга хос ва У ҳар бир нарсага қодирдир</p>
                <p className="zikr-item-text-translate"><strong>Hadis: </strong>Абу Ҳурайра розияллоҳу анҳудан ривоят қилинади:<br />
                 <br />Расулуллоҳ алайҳиссалом: <strong>«Ла илаҳа иллаллоҳу ваҳдаҳу ла шарийка лаҳ, лаҳул мулку ва лаҳул ҳамду ва ҳува ъала кулли шай`ин қодийр», деб айтса, гуноҳлари денгиз кўпигича бўлса ҳам, кечирилади»</strong> , дедилар.
                </p>
                <p className="zikr-item-text-translate  italic-text">Имом Муслим ривоятлари.</p>
            </li>
            <li className="duolar-item">
            <h3 className="zikr-item-title" >Намоздан кейинги дуо</h3>
            <p className="zikr-item-arab-text">اللهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الكُفْرِ وَالفَقْرِ وَعَذَابِ القَبْرِ</p>
            <p className="zikr-item-text">Аллоҳумма инний аъузу бика минал куфри вал фақри ва ъазабил қобр</p>
                <p className="zikr-item-text-translate italic-text"> <strong> Manosi :</strong>Аллоҳим, куфрдан, камбағалликдан ва қабр азобидан Сендан паноҳ тилайман.</p>
                <p className="zikr-item-text-translate"><strong>Hadis: </strong>Абу Бакр розияллоҳу анҳудан ривоят қилинади:<br />Расулуллоҳ соллаллоҳу алайҳи васаллам намоз сўнгида:
                 <br /> <strong>«Аллоҳумма инний аъузу бика минал куфри вал фақри ва ъазабил қобр»</strong> , дедилар.
                </p>
                <p className="zikr-item-text-translate italic-text">Ибн Сунний ривоятлари.</p>
            </li>
            </ul>
            <Bottom firstTo={'/hadislar'} secondTo={'/qoran'} thirdTo={'/zikr'}/>
            </div>
            
        </div>
    )
}
export default Duolar