import axios from "axios"
import Bottom from "../../assets/components/bottom/bottom"
import Header from "../../assets/components/header/header"
import {useState ,useEffect} from "react"

const Zikrlar =()=>{
   
     
    return(
        <div className="zikrlar">
            <Header title={"Barcha Zikrlar"} className="zikrlar-header" />
            <div className="zikrlar-container container">
                <ul className="zikrlar-list">
                <li className="zikrlar-item">
                    <h3 className="zikrlar-item-title">Кириш</h3>
                    <p className="zikrlar-text">Бисмиллаҳир роҳманир роҳийм.
                    Бандаларига зикр ва дуолар эшигини очиб қўйган Ҳақ таолога Унинг жалолига яраша ҳамду санолар бўлсин!
                    Умматларига зикр ва дуоларда намуна бўлган Расулимиз ва ҳабибимиз Муҳаммад мустафога саловоту дурудлар бўлсин!
                    Ўз диндошларига Қуръони Карим ва хадиси шарифлардаги зикр ва дуолар ҳақидаги таълимотларни омонат ила нақл қилган саҳобаи киромларга Аллоҳ таолонинг розилиги бўлсин!
                    Аллоҳ таоло: <br /> <strong>«Эй иймон келтирганлар! Аллоҳни кўп зикр қилинглар! Ва эртаю кеч Уни поклаб ёд этинглар»,</strong> деган («Аҳзоб» сураси, 41-42-оятлар).
                    Аллоҳни зикр қилиш қалбни Унга боғлаш, У мени кузатиб турибди, деган доимий эътиборда туриш, Аллоҳнинг буйруқларини бир лаҳза ҳам эсдан чиқармай амалга ошириб боришдир.
                    Ҳа, мўминларнинг Аллоҳни кўп зикр қилишлари матлуб амалдир. Аллоҳ кўп зикр қилингандагина турли ёлғон, бўҳтон, иғвo, ғийбат, чақимчилик каби гуноҳ гап-сўзлар биздан узоқлашади.
                    Аллоҳни кўп зикр килган одамнинг калбида беҳуда гапларга, сўкинишларга, кишига обрў келтирмайдиган ҳолатларга жой қолмайди.Аллоҳни кўп зикр қилган одамнинг қалбида дунёнинг, унинг матоҳларининг зикрига жой қолмайди. <br />
Аллоҳни кўп зикр қилган одамнинг қалбида турли кўнгилхушликларга, инсон зеҳнини чалғитувчи маишатларга жой қолмайди. <br />
Аллоҳни кўп зикр қилган одамнинг қалбига Аллоҳнинг муҳаббатидан бошқа муҳаббат сиғмайди
Аллоҳни кўп зикр қилган одамнинг тилига аввало Аллоҳнинг исми жо бўлади. Сўнгра бу муборак исм аста-секин унинг ҳалқумига, кўксига ва қалбига етиб боради. Бундай инсон тили билан Аллоҳнинг исмини айтмаса ҳам, қалби «Аллоҳ, Аллоҳ» деб туради. Ниҳоят, бутун вужуди шу ҳолатга етади. Ана шунда зокирлик мақомига эришади.
Имом Аҳмад ибн Ҳанбал раҳматуллоҳи алайҳи ривоят қилган ҳадисда қуйидагилар айтилади:«Расулуллоҳнинг ҳузурларига икки аъробий келди. Улардан бири:
«Эй Аллоҳнинг Расули, энг яхши одам ким?» деб сўради. <br />
Расулуллох, соллаллоҳу алайҳи васаллам: <br />
«Кимнинг умри узоқ бўлиб, амали яхши бўлса, ўша», дедилар.
Иккинчиси эса: <br />
«Эй Аллоҳнинг Расули, Исломнинг таклифлари кўпайди. Менга бир ишни амр қилингки, уни маҳкам тутай», деди. <br />
Расулуллоҳ соллаллоҳу алайҳи васаллам: «Доимо тилинг Аллоҳнинг зикри ила ҳўл бўлсин», дедилар. <br />
Ҳа, Аллоҳнинг зикрини кўп қилиш мўмин бандани олий мақомларга эриштиради.
Имом Бухорий ривоят қилган ҳадисда Пайғамбаримиз соллаллоҳу алайҳи васаллам:
«Роббингиз: «Модомики, бандамнинг лаблари Мени зикр этиб қимирлар экан, Мен у билан биргаман», дейди», деганлар. <br />
Имом Бухорий ривоят қилган ҳадиси қудсийда Пайғамбаримиз соллаллоҳу алайҳи васаллам:
«Аллоҳ, таоло «Ким Мени ичида зикр қилса, Мен ҳам уни ичимда зикр қиламан, ким Мени жамоат ичида зикр қилса, Мен ҳам уни унинг жамоатидан яхшироқ жамоат ичида зикр қиламан», дейди», деганлар.
Аллоҳ таоло яна: <br /> <strong>«Бас, Мени эсланг, сизни эсларман. Ва Менга шукр қилинг, куфр келтирманг»,</strong>деган («Бақара» сураси, 152-оят). <br />
        Ушбу оят ўзи қисқа бўлишига қарамай, олам - олам маъноларни ўз ичига олади. Аллоҳ таоло Ўзи яратган, ҳаёт, ризқ ҳамда бошқа керакли нарсаларни берган бандаларига:
    «Мени эслангиз», демоқда.
Хўш, Аллоҳ бу ожиз бандаларининг эслашига муҳтожми? Йўқ У беҳожат Зот. Ҳамма муҳтожлик бандаларда. Лекин бу амр бандаларга яхшилик етиши учундир. Улар Аллоҳни зикр қилишлари, эслашлари билан Аллоҳ таолонинг уларни зикр қилишига, эслашига эришадилар. Аммо зикр билан зикрнинг фарқи бор, албатта. Ҳеч нарсага арзимайдиган ожиз банданинг эслаши қайда-ю, оламларнинг Парвардигори бўлган Аллоҳ, таолонинг эслаши қайда! Банда қандай, қачон ва қаерда эслайди? Аллоҳ-чи?
Имом Бухорий Пайғамбаримиз соллаллоҳу алайҳи васалламдан ривоят қилган ҳадиси қудсийда Аллоҳ таоло:
«Эй одам боласи! Агар Мени ўзинг эсласанг, Мен ҳам сени Ўзим эслайман, агар кўпчилик ичида эсласанг, Мен сени фаришталар ичида эслайман», деган.
«Ва Менга шукр қилинг, куфр қилманг».
Шукр қилиш неъмат берувчи Зотга мақтов сўзларини айтиш ва неъматни уни берган Зотнинг розилиги учун ишлатиш билан бўлади. Аммо тили билан «Шукр», деса-ю, амали билан Аллоҳнинг айтганидан бошқани қилса, куфрони неъмат қилган бўлади. Мўмин-мусулмон киши доимо Аллоҳни зикр этиб, Унга шукр қилгандагина иши олға босади.</p>
<hr className="names-hr" />
                </li>
                <li className="zikrlar-item">
                    <h3 className="zikrlar-item-title">Дуоим қабул бўлсин десангиз…</h3>
                    <p className="zikrlar-text">Жазирий ўз асарларида дуолар қабул бўлишининг қуйидаги шартларини зикр қилганлар:

1. Ейдиган, ичадиган, киядиган нарсалари ва яшайдиган ерлари ҳаромдан бўлмаслиги лозим. <br />
2. Дуо пайтида ихлосли бўлиши зарур. <br />
3. Мусулмонларга қарши бўлмаслиги керак. <br />
4. Кийимлари ғоят тоза бўлиши даркор. <br />
5. Таҳоратли бўлиши лозим. <br />
6. Қиблага юзланган ҳолда дуо қилиши зарур. <br />
7. Тиз чўкиб ўтирган ҳолда дуо қилсин. <br />
8. Аввал нафл намози ўқимоғи даркор. <br />
9. Хайр-эҳсонлар қилиши керак. <br />
10. Камбағаллар ва илм толибларини хурсанд қилсин. <br />
11. Дуони Аллоҳ таолога ҳамд-санолар билан бошламоғи лозим. <br />
12. Пайғамбаримизга, барча набийларга, асҳоби киромга саловот-дурудлар айтмоғи зарур. <br />
13. Энг афзал саловот-намоздаги «Аллоҳумма солли», «Аллоҳумма барик»ни қанча кўп ўқиса, дуоси шунча тез қабул бўлади. <br />
14. Қўлларини кўкси баробар кўтариб, ҳовучларини очиб, кафтларини бирлаштириб дуо қилмоғи даркор. <br />15. Дуо одобига риоя қилмоғи керак. <br />
16. Аллоҳ таолога хушуъ ва хузуъ билан ёлбормоғи лозим. <br />
17. Аллоҳ таолонинг гўзал исмлари (Асмаи ҳусна)ни ўқиб, тилагини тиламоғи зарур. <br />
18. Ҳафиф (мулойим) овоз билан Аллоҳ таолога ёлбормоғи керак. <br />
19. Гуноҳларини эътироф этиб, Аллоҳдан афв ва мағфират сўраши даркор. <br />
20. Пайғамбарлардан ворид бўлган саҳиҳ дуоларни ўқимоғи лозим. <br />
21. Дуоларни такрор-такрор айтмоғи зарур. <br />

22. Тилагини қалб ҳузури билан сўрасин. <br />
23. Дуосини ҳамду-сано ва саловоту дурудлар билан якунламоғи керак. <br />
24. Қўлларини дуодан сўнг юзига суртсин. <br />
25. Ва дуоси қабул бўлишини умид қилмоғи даркор. <br />Шуни унутмаслик керакки, Пайғамбаримиз соллаллоҳу алайҳи васаллам дуода дунё ва охират саодатини тиламоқни тавсия этганлар.</p>
<hr className="names-hr" />
                </li>
                <li className="zikrlar-item">
                    <h3 className="zikrlar-item-title">Тонг ва кечқурунда</h3>
                    <p className="zikrlar-text">Абу Ҳурайра розияллоҳу анҳудан ривоят қилинади:
Расулуллоҳ соллаллоҳу алайҳи васаллам: «Ким эрталаб ёки кечқурун: <br /> <strong>«Субҳаналлоҳи ва биҳамдиҳи»</strong>(Аллоҳга ҳамд айтиш билан Уни айбу нуқсонлардан поклаб ёд этаман), деб юз марта айтса, қиёмат куни бирор киши ундан афзал бўлмайди. Фақат ана шу киши айтганидек ёки ундан ошириб айтсагина, бўлиши мумкин», дедилар. <br /> Имом Муслим ривоятлари. <br />
Абу Довуднинг ривоятларида: <br />
<strong>«Субҳаналлоҳил ъазийм ва биҳамдиҳи»,</strong>деб келган. <br /> Расулуллоҳ соллаллоҳу алайҳи васаллам қизларининг биридан ривоят қилинади. У зот қизларига тонг отганида: <br /> <strong>«Субҳаналлоҳи ва биҳамдиҳи, ла қуввата илла биллаҳи маша`аллоҳу кана ва ма лам йаша` лам йакун. Аъламу анналлоҳа ъала кулли шай`ин қодийр. Ва анналлоҳа қод аҳато бикулли шай`ин ъилма»</strong>, деб айтишни ўргатар эдилар. Чунки бу калималарни тонг отганида айтган киши кеч киргунича муҳофаза қилинади. Кеч кирганида айтса, тонг отгунича муҳофаза этилади.</p>
<hr className="names-hr" />
                </li>
                <li className="zikrlar-item">
                    <h3 className="zikrlar-item-title">Жума тонгида</h3>
                    <p className="zikrlar-text">Анас розияллоҳу анҳудан ривоят қилинади: <br />
Расулуллоҳ соллаллоҳу алайҳи васаллам: <br /> «Ким жума куни бомдод намозидан олдин: <br /> <strong>«Астағфируллоҳаллазий ла илаҳа илла ҳувал ҳаййул қоййум ва атубу илайҳ»,</strong> деб уч марта айтса, Аллоҳ таоло унинг гуноҳларини денгиз кўпигича бўлса ҳам, кечириб юборади», дедилар. <br /> Ибн Сунний ривоятлари.</p>
<hr className="names-hr" />
                </li>
                <li className="zikrlar-item">
                    <h3 className="zikrlar-item-title">Безовта бўлиб, ухлай олмаганда</h3>
                    <p className="zikrlar-text">Зайд ибн Собит розияллоҳу анҳу айтадилар: <br /> «Расулуллоҳ соллаллоҳу алайҳи васалламга уйқусизликдан шикоят қилдим, у зот: <br /> <strong>«Аллоҳумма ғоротин нужуму ва ҳада`атил ъуйуну ва анта ҳаййун қоййум, ла та`хузука синатун ва ла навм, йа ҳаййу, йа қоййуму, аҳдий лайлий ва аним ъайний, деб айт»,</strong> дедилар. Шу дуони айтган эдим, Аллоҳ мендан уйқусизликни кетказди». <br /> Ибн Сунний ривоятлари.</p>
                    <hr className="names-hr" />
                </li>
                <li className="zikrlar-item">
                    <h3 className="zikrlar-item-title">Азон ва иқоматни эшитганда</h3>
                    <p className="zikrlar-text">Абу Саид Худрий розияллоҳу анҳудан ривоят қилинади:<br /> Расулуллоҳ соллаллоҳу алайҳи васаллам:<br /> <strong>«Азонни эшитганингларда муаззин нима деса, ўшани айтинглар»</strong> дедилар. <br /> Имом Бухорий ва Муслим ривоятлари.<br />Азоннинг ҳаммасини эшитиб бўлганидан кейин Расулуллоҳга саловот айтиб, ортидан мана бу дуони ўқийди: <br />Жобир розияллоҳу анҳудан ривоят қилинади: <br /> Расулуллоҳ соллаллоҳу алайҳи васаллам: Ким азонни эшитган пайтида <br /> <strong>«Аллоҳумма робба ҳазиҳид даъватит таммаҳ вассолатил қоимаҳ, ати Муҳаммаданил васийлата вал фазийлаҳ вабъасҳу мақомам маҳмуданиллазий ваъадтаҳ», деб айтса, Қиёмат куни унга шафоат бўлади”,</strong>дедилар. <br /> Абу Довуд ривоятлари.</p>
                    <hr className="names-hr" />
                </li>
                </ul>
            <Bottom firstTo={'/hadislar'} secondTo={'/qoran'} thirdTo={'/zikr'}/>
            </div>
        </div>
    )
}
export default Zikrlar