export let mentionApi = {
    morningMention: [{
            id: 1,
            name: "Курсий ояти",
            textArab: `بِسمِ اللَّهِ الرَّحمٰنِ الرَّحيمِ اللَّهُ لا إِلٰهَ إِلاَّ هُوَ الحَيُّ القَيّومُ ۚ لا تَأخُذُهُ سِنَةٌ وَلا نَومٌ ۚ لَهُ ما فِي السَّماواتِ وَما فِي الأَرضِ ۗ مَن ذَا الَّذي يَشفَعُ عِندَهُ إِلاَّ بِإِذنِهِ ۚ يَعلَمُ ما بَينَ أَيديهِم وَما خَلفَهُم ۖ وَلا يُحيطونَ بِشَيءٍ مِن عِلمِهِ إِلاَّ بِما شاءَ ۚ وَسِعَ كُرسِيُّهُ السَّماواتِ وَالأَرضَ ۖ وَلا يَئودُهُ حِفظُهُما ۚ وَهُوَ العَلِيُّ العَظيمُ
            `,
            text: `Бисмиллаҳир роҳманир роҳийм. Аллоҳу лаа илаҳа иллаҳув алҳаййул қойюм. Лаа таъхузуҳу синатув валаа навм. Лаҳуу маа фис самаваати ва маа фил арз. Ман заллазий йашфаъу ъиндаху иллаа биизниҳ. Йаъламу маа байна айдийҳим ва маа холфаҳум. Ва лаа йуҳийтувна бишайъим мин ъилмиҳи илла бимаа шаа. Васиъа курсиййуҳус самаваати вал арз. Ва лаа йаувдуҳу ҳифзуҳума ва ҳувал ъалиййул ъазийм.`,
            meaning: `Меҳрибон ва раҳмли Аллоҳнинг номи ила бошлайман. Аллоҳ, Ундан ўзга илоҳ йўқ. У тирикдир ва қаййумдир. Уни мудроқ ҳам, уйқу ҳам олмас. Осмонлару ердаги нарсалар Уникидир. Унинг ҳузурида ўзининг изнисиз ҳеч ким шафоат қила олмас. У уларнинг олдиларидаги нарсани ҳам, ортларидаги нарсани ҳам билур. Унинг илмидан ҳеч нарсани иҳота қила олмаслар, магар ўзи хоҳлаганини, холос. Унинг курсиси осмонлару ерни қамраган. У уларни муҳофаза қилишдан чарчамас. Ва У Алий ва Азим зотдир.
            `,
            audio:'https://zikr.islom.uz/audio/d_1.mp3',
            playing:false,
            hadis: {
                writer: `Абу Ҳурайра розияллоҳу анҳудан ривоят қилинади:`,
                author: `Расулуллоҳ саллаллоҳу алайҳи васаллам:`,
                text: `«Ким тонг отган пайтда оятал курси ва Ғофир сурасининг аввалги икки ояти, "Ҳамим, танзийлул китааби миналлоҳил ъазийзил ъалийм..."ни ўқиса, ўша кун то кеч киргунича уни муҳофаза қилинади. Ким кеч кирган пайтда ўқиса, то тонг отгунича уни ўша тунда муҳофаза қилинади».`,
                rivoyat: `Имом Байҳақий ривояти.`
            }
        },
        {
            id: 2,
            name: `Ихлос сураси`,
            textArab: `بِسمِ اللَّهِ الرَّحمٰنِ الرَّحيمِ قُلْ هُوَ اللهُ أحَدٌ اللَّهُ الصَّمَدُ لَم يَلِد وَلَم يولَد وَلَم يَكُن لَهُ كُفُوًا أَحَدٌ
            `,
            text: `Бисмиллаҳир роҳманир роҳийм. Қул ҳуваллоҳу аҳад. Аллоҳус сомад. Лам йалид ва лам йувлад. Валам йакуллаҳу куфуван аҳад.`,
            meaning: `Меҳрибон ва раҳмли Аллоҳнинг номи ила бошлайман. Айт: «У Аллоҳ ягонадир». Аллоҳ–сомаддир. У туғмаган ва туғилмаган. Ва Унга ҳеч ким тенг бўлмаган.
            `,
            audio:'https://zikr.islom.uz/audio/d_2.mp3',
            playing:false,
            hadis: {
                writer: `Абдуллоҳ ибн Ҳубайб розияллоҳу анҳудан ривоят қилинади:`,
                author: ``,
                text: `Биз зулматли ёмғирли кечада Расулуллоҳ соллаллоҳу алайҳи васаллам намоз ўқиб беришлари учун у зотни ахтариб кўчага чиқдик. У зотни топганимизда, «Айт», дедилар. Мен ҳеч бир нарса айта олмадим. Сўнгра яна: «Айт», дедилар. Мен ҳеч нарса айта олмадим. Сўнгра яна: «Айт», дедилар. Мен: «Эй Расулуллоҳ, нимани айтаман?» дедим. Шунда Расулуллоҳ соллаллоҳу алайҳи васаллам:«Қул ҳуваллоҳу аҳад», «Қул аъузу бироббил фалақ», «Қул аъузу бироббиннас» сураларини кечки пайт ва эрталаб уч мартадан айтсанг, сенга ҳар бир нарсада кифоя қилади».`,
                rivoyat: `Абу Довуд, Термизий ва Насаийлар ривояти.`
            }
        },
        {
            id: 3,
            name: `Фалақ сураси`,
            textArab: `بِسمِ اللَّهِ الرَّحمٰنِ الرَّحيمِ قُلْ أعُوذُ بِرَبِّ الفَلَقِ مِن شَرِّ ما خَلَقَ وَمِن شَرِّ غاسِقٍ إِذا وَقَبَ وَمِن شَرِّ النَّفّاثاتِ فِي العُقَدِ وَمِن شَرِّ حاسِدٍ إِذا حَسَدَ
            `,
            text: `Бисмиллаҳир роҳманир роҳийм. Қул аъузу бироббил фалақ. Мин шарри маа холақ. Ва мин шарри ғосиқин изаа вақоб. Ва мин шаррин наффаасаати фил ъуқод. Ва мин шарри ҳаасидин изаа ҳасад.`,
            meaning: `Меҳрибон ва раҳмли Аллоҳнинг номи ила бошлайман. Тонг Роббисидан паноҳ сўрайман. У яратган нарсалар ёмонлигидан. Ва кириб келган қоронғу кечанинг ёмонлигидан. Ва тугунларга дам солувчилар ёмонлигидан. Ва ҳасад қилган, ҳасадчининг ёмонлигидан, деб айт.`,
            audio:'https://zikr.islom.uz/audio/d_3.mp3',
            playing:false,
            hadis: {
                writer: `Абдуллоҳ ибн Ҳубайб розияллоҳу анҳудан ривоят қилинади:`,
                author: ``,
                text: `Биз зулматли ёмғирли кечада Расулуллоҳ соллаллоҳу алайҳи васаллам намоз ўқиб беришлари учун у зотни ахтариб кўчага чиқдик. У зотни топганимизда, «Айт», дедилар. Мен ҳеч бир нарса айта олмадим. Сўнгра яна: «Айт», дедилар. Мен ҳеч нарса айта олмадим. Сўнгра яна: «Айт», дедилар. Мен: «Эй Расулуллоҳ, нимани айтаман?» дедим. Шунда Расулуллоҳ соллаллоҳу алайҳи васаллам:«Қул ҳуваллоҳу аҳад», «Қул аъузу бироббил фалақ», «Қул аъузу бироббиннас» сураларини кечки пайт ва эрталаб уч мартадан айтсанг, сенга ҳар бир нарсада кифоя қилади»`,
                rivoyat: `Абу Довуд, Термизий ва Насаийлар ривояти. `
            }
        },
        {
            id: 4,
            name: `Наас сураси`,
            textArab: `بِسمِ اللَّهِ الرَّحمٰنِ الرَّحيمِ قُلْ أعُوذُ بِرَبِّ النَّاسِ مَلِكِ النّاسِ إِلٰهِ النّاسِ مِن شَرِّ الوَسواسِ الخَنّاسِ الَّذي يُوَسوِسُ في صُدورِ النّاسِ مِنَ الجِنَّةِ وَالنّاسِ
            `,
            text: `Бисмиллаҳир роҳманир роҳийм. Қул аъузу бироббиннаас. Маликин наас. Илааҳин наас. Мин шаррил васваасил хоннаас. Аллазий ювасвису фий судуурин наас. Минал жиннати ваннаас.`,
            meaning: `Меҳрибон ва раҳмли Аллоҳнинг номи ила бошлайман. Одамлар Роббисидан, Одамлар подшоҳидан, Одамлар Илоҳидан паноҳ сўрайман. Беркиниб, кўриниб турувчи васвасачининг, Одамлар қалбларига васваса соладиганнинг, Жинлар ва одамлардан бўлганнинг ёмонлигидан, деб айт.`,
            audio:'https://zikr.islom.uz/audio/d_4.mp3',
            playing:false,
            hadis: {
                writer: `Абдуллоҳ ибн Ҳубайб розияллоҳу анҳудан ривоят қилинади:`,
                author: ``,
                text: `Биз зулматли ёмғирли кечада Расулуллоҳ соллаллоҳу алайҳи васаллам намоз ўқиб беришлари учун у зотни ахтариб кўчага чиқдик. У зотни топганимизда, «Айт», дедилар. Мен ҳеч бир нарса айта олмадим. Сўнгра яна: «Айт», дедилар. Мен ҳеч нарса айта олмадим. Сўнгра яна: «Айт», дедилар. Мен: «Эй Расулуллоҳ, нимани айтаман?» дедим. Шунда Расулуллоҳ соллаллоҳу алайҳи васаллам:«Қул ҳуваллоҳу аҳад», «Қул аъузу бироббил фалақ», «Қул аъузу бироббиннас» сураларини кечки пайт ва эрталаб уч мартадан айтсанг, сенга ҳар бир нарсада кифоя қилади
                `,
                rivoyat: `Абу Довуд, Термизий ва Насаийлар ривояти.`
            }
        },
        {
            id: 5,
            name: `Уйқудан тургандаги дуо`,
            textArab: `أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ للهِ رَبِّ العَالَمِينَ. اللهُمَّ أَسْأَلُكَ خَيْرَ هَذَا اليَوْمِ فَتْحَهُ وَنَصْرَهُ وَنُورَهُ وَبَرَكَتَهُ وَهُدَاهُ وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِيهِ وَشَرِّ مَا بَعْدَهُ
            `,
            text: `Асбаҳнаа ва асбаҳал мулку лиллаҳи роббил ъаламийн. Аллоҳумма ас'алука хойра ҳазал йавми фатҳаҳу ва насроҳу ва нуроҳу ва барокатаҳу ва ҳудаҳу ва аъузу бика мин шарри маа фийҳи ва шарри маа баъдаҳ`,
            meaning: `Биз ҳам, мулк ҳам оламлар парвардигори Аллоҳники бўлган ҳолда тонг оттирдик. Эй Раббим, бу куннинг яхшисини, фатҳ бўлишини, ғалабасини, нурини, баракасини, ҳидоятини сўрайман. Ва Сендан бу куннинг ва бу кундан кейингисининг ёмонлигидан паноҳ тилайман`,
             audio:'https://zikr.islom.uz/audio/d_8.mp3',
             playing:false,
            hadis: {
                writer: `Абу Молик Ашъарий розияллоҳу анҳудан ривоят қилинади:`,
                author: `
                Расулуллоҳ соллаллоҳу алайҳи васаллам:`,
                text: `
                «Сизлардан бирингиз тонг отганида:«Асбаҳнаа ва асбаҳал мулку лиллаҳи роббил ъаламийн. Аллоҳумма ас'алука хойра ҳазал йавми фатҳаҳу ва насроҳу ва нуроҳу ва барокатаҳу ва ҳудаҳу ва аъузу бика мин шарри маа фийҳи ва шарри маа баъдаҳ», деб айтсин. Сўнгра кеч кирганида ҳам худди шундай десин`,
                rivoyat: `Абу Довуд ривоятлари.`
            }
        },
        {
            id: 6,
            name: `Саййидул истиғфор`,
            textArab: `اللهُمَّ أَنْتَ رَبِّي، لاَ إِلَهَ إِلاَّ أَنْتَ خَلَقْتَنِي، وَأَنَا عَبْدُكَ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ وَأَبُوءُ بِذَنْبِي فَاغْفِرْ لِي فَإِنَّهُ لاَ يَغْفِرُ الذُّنُوبَ إِلاَّ أَنْتَ
            `,
            text: `Аллоҳумма анта роббий ла илаҳа илла анта холақтаний ва ана ъабдука ва ана ъала ъаҳдика ва ваъдика мастатоъту аъузу бика мин шарри ма сонаъту, абу'у лака биниъматика ъалаййа ва абу'у бизамбий фағфирлий фаиннаҳу ла йағфируз зунуба илла анта`,
            meaning: `Аллоҳим, Сен парвардигоримсан, Сендан бошқа илоҳ йўқ. Мени халқ қилдинг ва мен Сенинг қулингман. Мен Сенга берган ваъдамда ва Сенга берган аҳдимда қодир бўлганимча турибман. Қилган нарсаларимнинг ёмонидан Сенинг номинг билан паноҳ тилайман. Менга ато қилган неъматларингга иқрор бўлдим. Ва яна гуноҳларимга ҳам иқрор бўлдим. Менинг гуноҳларимни кечир. Чунки Сендан бошқаси гуноҳларни кечира олмайди`,
            audio:'https://zikr.islom.uz/audio/d_13.mp3',
            playing:false,
            hadis: {
                writer: `Шаддод ибн Авс розияллоҳу анҳудан ривоят қилинади:`,
                author: `
                Расулуллоҳ соллаллоҳу алайҳи васаллам:`,
                text: ` «Ким саййидул истиғфор:«Аллоҳумма анта роббий ла илаҳа илла анта холақтаний ва ана ъабдука ва ана ъала ъаҳдика ва ваъдика мастатоъту аъузу бика мин шарри ма сонаъту, абу'у лака биниъматика ъалаййа ва абу'у бизамбий фағфирлий фаиннаҳу ла йағфируз зунуба илла анта»ни кечки пайт айтиб, тонг отгунича вафот этса, жаннатга киради. Ким тонгда айтиб, шу куни вафот этса, унда ҳам жаннатга киради»`,
                rivoyat: `Имом Бухорий ривоятлари.`
            }
        },
        {
            id: 7,
            name: `Тонгги зикр`,
            textArab: `رَضِيتُ بِاللهِ رَبًّا وَبِالإِسْلاَمِ دِينًا وَبِمُحَمَّدٍ صلى الله عليه وسلم رَسُولاً
            `,
            text: `Розийту биллаҳи роббан ва бил ислами дийнан ва бимуҳаммадин соллаллоҳу алайҳи васаллама росула`,
            meaning: `Аллоҳни раббим деб, Исломни диним деб, Муҳаммад алайҳиссаломни расул деб рози бўлдим`,
            audio:'https://zikr.islom.uz/audio/d_12.mp3',
            playing:false,
            hadis: {
                writer: `Абу Саид Худрий розияллоҳу анҳудан ривоят қилинади:`,
                author: ` Расулуллоҳ соллаллоҳу алайҳи васаллам:`,
                text: ` «Ким:«Розийту биллаҳи роббан ва бил ислами дийнан ва бимуҳаммадин соллаллоҳу алайҳи васаллама росула», деса, унга жаннат вожиб бўлади»
                `,
                rivoyat: `Абу Довуд ривоят қилганлар.
                `
            }
        },
        {
            id: 8,
            name: `Тонг отганида ва кун ботганида`,
            textArab: `اللهُمَّ إنِّي أصْبَحْتُ أُشْهِدُكَ، وَأُشْهِدُ حَمَلَةَ عَرْشِكَ، وَمَلاَئِكَتِكَ وَجَمِيعَ خَلْقِكَ، أَنَّكَ أنْتَ اللهُ لاَ إلَهَ إلاَّ أنْتَ وَحْدَكَ لاَ شَرِيكَ لَكَ، وَأنَّ مُحَمَّدًا عَبْدُكَ وَرَسُولُكَ
            `,
            text: `Аллоҳумма инний асбаҳту ушҳидука ва ушҳиду ҳамалата ъаршика ва малаикатика ва жамийъа холқик, аннака анталлоҳу лаа илаҳа илла анта ваҳдака лаа шарийка лака ва анна Муҳаммадан ъабдука ва росулук`,
            meaning: `Аллоҳим, албатта, мен тонг оттирдим. Сени ҳамда аршингни кўтарувчи фаришталарингни ва ҳамма халқ қилган нарсаларингни гувоҳ қилиб айтаманки, Сендан бошқа илоҳ йўқ, Муҳаммад соллаллоҳу алайҳи васаллам Сенинг банданг ва расулингдир`,
            audio:'https://zikr.islom.uz/audio/d_9.mp3',
            playing:false,
            hadis: {
                writer: `Анас розияллоҳу анҳудан ривоят қилинади:`,
                author: ` 
                Расулуллоҳ соллаллоҳу алайҳи васаллам:`,
                text: `«Аллоҳумма инний асбаҳту ушҳидука ва ушҳиду ҳамалата ъаршика ва малаикатика ва жамийъа холқик, аннака анталлоҳу лаа илаҳа илла анта ваҳдака лаа шарийка лака ва анна Муҳаммадан ъабдука ва росулук», деб айтса, Аллоҳ таоло танасининг тўртдан бирини дўзахдан халос қилади. Ким шуни икки марта айтса, Аллоҳ таоло унинг ярмини дўзахдан халос қилади. Ким уч марта айтса, Аллоҳ таоло унинг тўртдан уч қисмини дўзахдан халос этади. Ким тўрт марта айтса, Аллоҳ таоло уни бутунлай дўзахдан халос қилади»
                `,
                rivoyat: `Абу Довуд ривоят қилганлар.
                `
            }
        },
        {
            id: 9,
            name: `Саловат`,
            textArab: `اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى إبْرَاهِيمَ وَعَلَى آلِ إبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ. اللهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى ابْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ 
            `,
            audio:'https://zikr.islom.uz/audio/d_25.mp3',
            playing:false,
            text: `Аллоҳумма солли ъала Муҳаммадин ва ъала али Муҳаммад, кама соллайта ъала Иброҳийма ва ъала али Иброҳийм, иннака ҳамийдум мажийд. Аллоҳумма барик ъала Муҳаммадин ва ъала али Муҳаммад, кама барокта ъала Иброҳийма ва ъала али Иброҳийм, иннака ҳамийдум мажийд`,
            meaning: `Аллоҳим, Иброҳим алайҳиссаломни ва у зотнинг оилаларини яхшилик ва раҳматда қилганинг каби, Муҳаммад алайҳиссаломни ва у зотнинг оилаларини ҳам яхшилик ва раҳматда қил. Албатта, Сен мақтовли улуғ зотсан. Аллоҳим, Иброҳим алайҳиссаломни ва у зотнинг оилаларини баракотли қилганингдек, Муҳаммад алайҳиссаломни ва у зотнинг оилаларини ҳам баракотли қил. Албатта, Сен мақтовли улуғ зотсан`,
            hadis: {
                writer: `Абу Дардо розияллоҳу анҳудан ривоят қилинади:`,
                author: ` 
                Набий саллаллоҳу алайҳи васаллам:`,
                text: `"Ким менга тонг отганида ўнта ва кеч кирганида ўнта салавот айтса, Қиёмат куни шафоатимга эришади"
                `,
                rivoyat: `Имом Табароний ривояти.
                `
            }
        },
    ],
}